{
  "translate": "បកប្រែ",
  "dictionary": "វចនានុក្រម",
  "save": "រក្សាទុក",
  "history": "ប្រវត្តិ",
  "setting": "ការកំណត់",
  "write_text": "សរសេរអត្ថបទរបស់អ្នក",
  "edit": "កែសម្រួល",
  "delete_all": "លុបទាំងអស់",
  "search": "ស្វែងរក",
  "document": "ឯកសារ",
  "doc_des": "បង្ហោះ និងជ្រើសរើសប្រយោគសម្រាប់ការបកប្រែ",

  "light": "ផ្ទៃភ្លឺ",
  "dark": "ផ្ទៃងងឹត",
  "use_device_settings": "ប្រើការកំណត់ឧបករណ៍",
  "use_device_descriptors": "កំណត់រូបបង្ហាញឲ្យត្រូវនឹងការកំណត់បង្ហាញ និងភាពភ្លឺរបស់ឧបករណ៍របស់អ្នក",

  "switch_language": "ប្តូរភាសា",
  "appearance": "រូបរាង",
  "about": "អំពី",
  "credit": "ក្រេឌីត និងអាជ្ញាប័ណ្ណ",
  "text_size": "ទំហំ​អត្ថបទ",
  "text_size_des": "កម្មវិធីរបស់យើងគាំទ្រដោយប្រភេទកែតម្រូវ Dynamic នឹងកំណត់ទៅតាមទំហំអានដែលអ្នកចូលចិត្តខាងក្រោម។",

  "english_language": "ភាសា​អង់គ្លេស",
  "khmer_language": "ភាសាខ្មែរ",
  "korean_language": "ភាសា​កូរ៉េ",
  "chinese_language": "ភាសាចិន",

  "about_desc": "អេក្រង់នេះផ្តល់ព័ត៌មានអំពីកម្មវិធី",
  "credit_desc": "ទំព័រនេះផ្តល់ព័ត៌មានអំពីឥណទាន និងអាជ្ញាប័ណ្ណ",

  "about_app": "អំពីកម្មវិធី",
  "about_app_desc": "<b>Phum Dictionary</b> បង្កើតឡើងដោយក្រុមហ៊ុន <b>Biz Solution</b> គឺជាធនធានឌីជីថលប្រកបដោយភាពច្នៃប្រឌិតដែលត្រូវបានរចនាឡើងដើម្បីដោះស្រាយបញ្ហាប្រឈមរបស់សិស្សានុសិស្ស និងសាធារណជនទូទៅក្នុងការបកប្រែភាសាផ្សេងៗរួមមាន ខ្មែរ អង់គ្លេស កូរ៉េ និងចិន។ <b>Phum Dictionary</b> មិនត្រឹមតែជួយសម្រួលការទំនាក់ទំនងប្រកបដោយប្រសិទ្ធភាពប៉ុណ្ណោះទេ ប៉ុន្តែថែមទាំងរួមចំណែកដល់ការអភិរក្ស និងការផ្សព្វផ្សាយភាសា និងអក្សរខ្មែរផងដែរ។",
  "development_by": "អភិវឌ្ឍដោយ",
  "kh_to_kh": "ខ្មែរ​ទៅ​ខ្មែរ",
  "app": "កម្មវិធី",
  "version": "កំណែ",

  "drop_file": "ទម្លាក់ឯកសារនៅទីនេះ\nឬជ្រើសរើសឯកសារ",
  "browse": "រកមើលឯកសារ",

  "show_more": "បង្ហាញច្រើនទៀត",
  "extract_text": "អត្ថបទដកស្រង់",

  "dictionary_not_available": "វចនានុក្រមភាសាបច្ចុប្បន្នមិនទាន់មាននៅឡើយទេ។ វានឹងមានក្នុងពេលឆាប់ៗនេះ។ សូមពិនិត្យមើលឡើងវិញនៅពេលក្រោយ។",
  "coming_soon": "នឹង​មក​ឆាប់ៗ",
  "loading": "កំពុង​ផ្ទុក...",

  "image": "រូបភាព",
  "camera": "កាមេរ៉ា",

  "cancel": "បោះបង់",

  "you_select_all": "អ្នកបានជ្រើសរើសទាំងអស់",
  "select_all": "ជ្រើសរើស​ទាំងអស់",

  "notifications": "សេចក្តីជូនដំណឹង",

  "system": "ប្រព័ន្ធ",

  "copy_all_text": "អ្នកបានចម្លងអត្ថបទទាំងអស់",
  "select_all_text": "អ្នកបានជ្រើសរើសអត្ថបទទាំងអស់",

  "lost_connection": "សូមពិនិត្យការតភ្ជាប់អ៊ីនធឺណិតរបស់អ្នក។",

  "okay": "យល់ព្រម",

  "no_text_found": "មិនអាចរកឃើញអត្ថបទនៅក្នុងឯកសារទេ។ សូមផ្ទៀងផ្ទាត់ថាឯកសាររបស់អ្នកមានអត្ថបទដែលអាចអានបាន ហើយសូមព្យាយាមម្តងទៀត។",

  "security_alert": "ការជូនដំណឹងសុវត្ថិភាព",

  "risk_device_message": "ឧបករណ៍របស់អ្នកដូចជាត្រូវបាន Jailbreak ឬ Rooted ដែលអាចបង្ករឲ្យមានហានិភ័យសុវត្ថិភាព និងធ្វើឱ្យទិន្នន័យរបស់អ្នកមានការគំរាមកំហែង។ ដើម្បីធានាបទពិសោធន៍ប្រើប្រាស់ដែលមានសុវត្ថិភាព ការប្រើប្រាស់កម្មវិធីនេះត្រូវបានកំណត់។ \n\nដើម្បីចូលប្រើប្រាស់ PhumDictionary វិញ យើងសូមណែនាំឱ្យអ្នកស្ដារឧបករណ៍របស់អ្នកទៅសភាពដើម ដោយលុបការធ្វើ Jailbreak ឬការចូលប្រើជា Root។",

  "emulator_message": "⚠️ រកឃើញ Emulator! ⚠️\n\nការរត់កម្មវិធីនេះនៅលើ Emulator មិនត្រូវបានអនុញ្ញាតសម្រាប់មូលហេតុសុវត្ថិភាព។ សូមប្រើឧបករណ៍ពិតប្រាកដដើម្បីធានាការពារទិន្នន័យ និងដំណើរការបានត្រឹមត្រូវ។",

  "external_storage_message": "🔒 គ្រោះថ្នាក់សុវត្ថិភាព! 🔒\n\nកម្មវិធីនេះត្រូវបានដំឡើងលើឧបករណ៍ផ្ទុកខាងក្រៅ ដែលអាចបង្កើនហានិភ័យនៃការលេចធ្លាយទិន្នន័យ និងការចូលប្រើដោយគ្មានការអនុញ្ញាត។ សូមដំឡើងវាលើឧបករណ៍ផ្ទុកខាងក្នុងដើម្បីបានសុវត្ថិភាពល្អជាង។",

  "app_compromise_message": "🚨 ភាពត្រឹមត្រូវរបស់កម្មវិធីត្រូវបានលុកលុយ! 🚨\n\nបានរកឃើញការកែប្រែមិនមានសិទ្ធិក្នុងកម្មវិធី។ សូមប្រាកដថាអ្នកកំពុងប្រើកំណែផ្លូវការពី App Store ដើម្បីការពារគ្រោះថ្នាក់សុវត្ថិភាព។",

  "risk_message": "🚨 ការជូនដំណឹងសុវត្ថិភាព! 🚨\n\nឧបករណ៍របស់អ្នកត្រូវបានរកឃើញថាត្រូវបាន Jailbreak ឬ Root។ វាអាចធ្វើឱ្យទិន្នន័យផ្ទាល់ខ្លួនរបស់អ្នកស្ថិតក្នុងហានិភ័យចំពោះការកេងប្រវ័ញ្ចព័ត៌មាន ការចូលប្រើដោយគ្មានការអនុញ្ញាត និងការគំរាមកំហែងពីមេរោគ។ សូមប្រើឧបករណ៍ដែលមានសុវត្ថិភាពដើម្បីបន្ត។",
  "debug_message": "🔍 ការរកឃើញ Debugging! 🔍\n\nការរត់កម្មវិធីនៅក្នុងម៉ូដ Debug អាចបង្ហាញទិន្នន័យសំងាត់ និងភាពឧបសគ្គសុវត្ថិភាព។ សូមប្រើបរិយាកាសដែលមានសុវត្ថិភាព។",

  "developer_mode_message": "⚠️ ម៉ូដអ្នកអភិវឌ្ឍន៍បានបើក! ⚠️\n\nសម្រាប់មូលហេតុសុវត្ថិភាព សូមបិទម៉ូដអ្នកអភិវឌ្ឍន៍មុនពេលប្រើកម្មវិធីនេះ។",

  "back": "ត្រឡប់ទៅក្រោយ",

  "English": "អង់គ្លេស",
  "Khmer": "ខ្មែរ",
  "Korean": "កូរ៉េ",
  "Chinese": "ចិន",

  "tts_limit_message": "អត្ថបទលើសកំណត់អក្សរ (200 តួអក្សរ) សម្រាប់ការបំពងសំឡេង។ សូមបង្កើតអត្ថបទខ្លីជាងនេះហើយព្យាយាមម្ដងទៀត។",

  "new_update": "មានបច្ចុប្បន្នភាពថ្មី",
  "new_update_des1": "កំណែថ្មី",
  "new_update_des2": "មាននៅហើយ។ សូមធ្វើបច្ចុប្បន្នភាពកម្មវិធី។",
  "no_tts": "កំហុស៖ មិនមានអត្ថបទសម្រាប់និយាយទេ។",

  "requried_ios_version": "លក្ខណៈពិសេសនេះត្រូវការប្រើ iOS 15.5 ឬខ្ពស់ជាងនេះ។ សូមធ្វើបច្ចុប្បន្នភាពឧបករណ៍របស់អ្នកដើម្បីបន្ត។",

  "offline_message": "អ្នកកំពុងប្រើ offline mode។ មុខងារខ្លះអាចមានការរឹតត្បិត",
  "not_found": "រកមិនឃើញ",
  "maintenance": "ម៉ាស៊ីនមេកំពុងនៅក្រោមការថែទាំ"
}
